Revit 2027 API
ParameterTypeId.MassDataShadeDepth Property
 "Shade Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MassDataShadeDepth { get; }
Public Shared ReadOnly Property MassDataShadeDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MassDataShadeDepth {
	ForgeTypeId^ get ();
}
static member MassDataShadeDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace